Enums/МесяцаГода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>МесяцаГода</Name>
			<Comment>Месяца года.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Январь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Февраль</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Март</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Апрель</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Май</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Июнь</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Июль</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Август</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сентябрь</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Октябрь</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ноябрь</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декабрь</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/МесяцаГода/Ext/ManagerModule.bsl
Функция НомерМесяцаГода(МесяцГода) Экспорт
	
	// Метаданные не используются намеренно.
	Если (МесяцГода = Перечисления.МесяцаГода.Январь) Тогда
		Возврат 1;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Февраль) Тогда
		Возврат 2;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Март) Тогда
		Возврат 3;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Апрель) Тогда
		Возврат 4;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Май) Тогда
		Возврат 5;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Июнь) Тогда
		Возврат 6;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Июль) Тогда
		Возврат 7;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Август) Тогда
		Возврат 8;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Сентябрь) Тогда
		Возврат 9;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Октябрь) Тогда
		Возврат 10;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Ноябрь) Тогда
		Возврат 11;
	КонецЕсли; 
	Если (МесяцГода = Перечисления.МесяцаГода.Декабрь) Тогда
		Возврат 12;
	КонецЕсли; 

	Возврат 0;

КонецФункции // НомерДняНедели()
